{"pages":[{"title":"Categories","date":"2020-12-13T13:53:44.131Z","path":"categories/index.html","text":""},{"title":"Tags","date":"2020-12-13T13:53:44.135Z","path":"tags/index.html","text":""},{"title":"关于我","date":"2020-12-13T14:53:54.000Z","path":"about/index.html","text":"一名大三在校生，正在准备考研。我写博客的目的：它是我自己精心养护的“后花园”，没事可以看看，打理打理。通过写作输出阶段性学习成果丰富我的简历，不过现阶段我还写不出什么有深度的技术文章，但我会努力的。文字有穿越时间的力量，人人都具备穿越时空的能力，只是你没有善加利用。1234567891011/** * * .-~~~~~~~~~-._ _.-~~~Java~~~-._ * __.' ~. .~ Web Python * .'// 欢迎访问 \\./ JavaScript \\\\`. * .'// | CSS C++ \\\\`. * .'// .-~\"\"\"\"\"\"\"~~~~-._ HTML _,-~~~~\"\"\"\"\"\"\"~-. \\\\`. * .'//.-\" `-. | .-' \"-.\\\\`. * .'//______.============-.. \\ | / ..-============.______\\\\`. * .'______________________________\\|/______________________________`. */"}],"posts":[{"title":"学习任何知识都是在学习它的历史","date":"2021-03-29T08:38:17.000Z","path":"post/learning-any-knowledge-is-learning-its-history/","text":"我觉得这句话跟「站在巨人的肩膀上」有者千丝万缕的联系。千百年来，人们学习能力的提高主要依赖的就是语言，语言使得知识跃然纸上，让那些经历了无数人思考的过程变成后一代人的财富。知识就是财富，这句话一点都不为过。回到题目，这里的历史是指你所学的某个知识的背后所牵扯的到的历史，即这一知识的“前世今生”。举个例子，我相信在你之前，已经有很多前辈通过思考想出来了你所疑惑的问题，倘若你通过搜索引擎找到了这位前辈写的答案。从某种程度上说，你学的就是这位前辈为该知识点总结的“历史”。文字有穿越的力量，不光是在空间上，更是在时间上。当它被加上了时间这一属性后，就变成了描述某种事物的历史。学习从历史开始，是让你参考着前人的思考过程，而不是那些冰冷冷的结论和公式，让前人带领着你走向正确的学习道路上面去。只有这样，你才能不费力的思考，或者是缩短你思考的周期。","tags":[{"name":"学习认知","slug":"学习认知","permalink":"http://yoursite.com/tags/%E5%AD%A6%E4%B9%A0%E8%AE%A4%E7%9F%A5/"}],"categories":[]},{"title":"Web + Knowledge Base = Wiki","date":"2021-03-28T14:14:33.000Z","path":"post/self-wiki/","text":"","tags":[],"categories":[]},{"title":"学习危机：为什么你不是真的去学习","date":"2020-08-11T05:37:06.000Z","path":"post/learning-crisis/","text":"前言软件，一个可见性差、复杂度高的产品。知识，一个不可探知、活跃在大脑中的神经元连接。人们往往想通过考试来评价自己的知识掌握程度，但往往会有不少差错。一个人现学的知识可以测试并量化出来，但一个学习能力，是评测不出来的。软件是教机器去学习，而人脑，没有人能够指点它，你只能不断地接受外界的信息，然后由大脑自行判断，自行取舍……学习大致分为两类：潜意识地进行学习和无意识地进行学习，我们只探讨前者。1. 问问你自己你一定听说过这一说法：“人类越来越聪明，越来越会学习。”这句话乍一听以为是智力因素，其实不是，是人类长期以来学习的方式变了，变的越来越高效了。在现在，通过互联网、智能设备进行学习已经成为大学生的必修课，为什么？因为当你真正结合它到学习中时，你会发现它足够高效。大脑学习的机制在我看来，很简单，你只需要给它信息就好，当然，对于思考类信息，你需要不断地思考。那么人类是如何学的更高效起来了呢？其实这个问题很不好回答，如果你随便问一个人：“你是如何学习的？”每个人都可以回答一二，这个问题没有明确的答案。但如果你问他：“你是跟谁学习的？”这个问题虽然奇怪，但仔细分析，你自己想想看：“你到底是怎么学习的？”、“你的学习习惯到底是怎么养成的？”、“是谁教会了你学习？”、“你的学习方法的依据是什么？”、“你怎么验证你的学习方法肯定是有效的？”、“你觉得你学习足够高效吗？”…… 你可能一时答不上来，因为大脑不会没事去总结自己是如何学习的，你会发现，你就是会学习，不管是把你怎么样，你总是控制不住自己去吸收外界信息，思考起来。学习好像就是一种天生的能力一样，伴随着你，那些学习方法也是潜移默化地学会了，你自己都不知道这是何时发生的事情。还有最后一个最关键的问题：“你想知道别人是怎么学习的吗？”，我相信每个人都希望得知那些有名有望的人是如何学习的，但结局往往是：他们即便说了，你也不会明白，你明白了，可能也不会去照着做。学习，到头来还是一门学问，如果创立一个专门学习“如何学习”的课程，我相信绝对是可行的。名字就叫“学习工程”，如何？2. 危机从何而来仔细想想“软件危机”是如何产生的？是人们对软件的需求、软件的复杂度日益提高带来的，人们迫切需要一种方式来改变现状。那么把“软件”换成“学习”，你会发现，这也是说的通的，人们渴望高效的进行学习，但知识越来越复杂，学习的难度也变得越来越大，所以“危机”真的来了……顺应解决“软件危机”所建立的新学科 —— 软件工程，你可以通过学习这门学科，了解提高学习的方法也是或多或少的有联系的。3. 学习工程学习也需要明确自己的学习需求，也需要进行可行性研究，只不过当你学习的知识不那么复杂时，这些过程都被忽略了。对问题和目标的正确认识是解决任何问题的前提和出发点，软件开发不例外，学习同样不例外。学习就好比开发软件，要想更好地熟悉某个学科所包含的知识，你需要遵循学习原则，借用学习思想，使用学习工具，控制学习周期，了解学习本质……后记为什么你不是真的去学习？因为你从始至终没有停下来去思考一个问题 —— 该怎么学习？有时候学习总是卡壳，喜欢胡思乱想，总是问自己为什么学的那么费劲，而内心深处又有一个声音告诉我：“是你学错了方法”，所以我越来越好奇「元学习」这一概念。我曾经在图书馆发了一下午的呆，写下来这么一篇拙见，希望与你一同探讨。","tags":[{"name":"学习认知","slug":"学习认知","permalink":"http://yoursite.com/tags/%E5%AD%A6%E4%B9%A0%E8%AE%A4%E7%9F%A5/"}],"categories":[]},{"title":"浅析逻辑代数、命题逻辑、一阶逻辑、高阶逻辑和数理逻辑","date":"2020-04-11T17:28:33.000Z","path":"post/simple-analysis-of-discrete-mathematics/","text":"前言此文是在本人学习完离散数学中的数理逻辑部分后，对标题中各部分之间的联系存在很大的疑惑。特此进行总结，水平有限，如有错误，欢迎指出。1. 从逻辑代数开始逻辑代数是一种用于描述客观事物逻辑关系的数学方法，由英国科学家乔治·布尔(George·Boole)于19世纪中叶提出，因而又称布尔代数。所谓逻辑代数，就是把逻辑推理过程代数化，即把逻辑推理过程符号化。2. 从逻辑代数到命题逻辑同样的，命题逻辑是将那些具有真假意义的陈述句接着进行符号化，产生原子命题。与此同时，当我们把逻辑代数中的运算符：与(·)、或( + )、非( — )，替换成命题逻辑中的五大联结词：合取( ∧ )、析取( ∨ )、非( ¬ )、蕴涵( → ) 和等价( ↔ ) 之后，我们就进入了命题逻辑的研究领域。需要指出的是，命题逻辑也叫作命题演算，后者的出现就是用来讨论前者的。它与下面出现的一阶逻辑（谓词逻辑）都是数理逻辑的子集（或称之为分支），是数理逻辑的两个最基本的也是最重要的组成部分。有人可能会问，为什么不从数理逻辑开始，其实意义不大。要谈数理逻辑，不可避免的下一个主题就是逻辑代数。为什么这样说，因为数理逻辑一开始的诞生是没有意义的，它的创始人正是我们熟知的莱布尼茨（没错，就是高数中的那个牛顿-莱布尼茨公式）。莱布尼茨一开始是想要建立一套普遍的符号语言，从而将一些由自然语言的推理转换成用符号演算。但可惜他的工作只是开了个头，而且没有太多的发表，因此影响不大。而真正使数理逻辑这门学科迅速扩张的是开头所说的英国科学家——乔治·布尔，而他所做的正是将逻辑代数化。2.1 浅谈数理逻辑与数学和逻辑学数理逻辑又称符号逻辑、理论逻辑，是一门用数学方法研究逻辑或形式逻辑的学科，这是百度词条给出的解释。还有一句话非常拗口：它既是数学的一个分支，也是逻辑学的一个分支。其研究对象是对证明和计算这两个直观概念进行符号化以后的形式系统。说白了，数理逻辑研究的并不是数学领域，而是计算机科学等领域。但归根到底用到的还是数学方法，例如数学方法中的符号的使用、公式的定义等。数理逻辑除了跟数学有关，还跟逻辑学有关。其实我一直以为逻辑学是数学的一个分支，但当我检索信息时发现并不是这样简单。因为没有学过逻辑学，只能暂时认为两者的研究对象、研究任务和研究目标是不同的。但最重要的一点是，两者是不可割裂的，因为逻辑出现在数学中，是为了证明数学里面有一个不能证明的，逻辑用来推断未知，那很多未知需要用数学来表现出来。数学是研究数量、结构、变化以及空间模型等概念的一门学科。透过抽象化和逻辑推理的使用，由计数、计算、量度和对物体形状及运动的观察中产生。主要研究：数量、结构、空间和基础与哲学。逻辑是人的一种抽象思维，是人通过概念、判断、推理、论证来理解和区分客观世界的思维过程。逻辑学就是由上述过程产生的一门学科。逻辑的本质是寻找事物的相对关系，并用已知推断未知。2.2 命题逻辑的符号化思想关于命题逻辑，相信学过离散的人都很熟悉。这里只提一下命题逻辑的符号化思想，这又是一种抽象的方法。数理逻辑的诞生就是代替使用自然语言进行推理，因此必须对其符号化，用元符号进行表示。而这种符号化带来的好处就是消除了自然语言中的二义性，例如 “非 p”，这是一个典型的半符号化命题，自然语言 “非” 会产生二义性，因为你可以把 “非 p” 解释成 “p 不成立” 等。为此，命题逻辑进一步符号化，用 “¬” 来代替 “非”，“不成立” 等。并且还定义一系列规则，比如说：¬p 为真当且仅当 p 为假。符号化思想也带来了一些在数理逻辑中不能够处理的麻烦，甚至是一些常见的简单推理。这里引用书上的一个例子，考虑这一命题：凡偶数都能被 2 整除，6 是偶数，所以，6 能被 2 整除。这个问题如果使用命题逻辑中的形式化推理，将无法判断正确性。在命题逻辑中只能将推理中出现的 3 个简单命题依次符号化为 p，q，r，将推理的形式结构符号化为 (p ∧ q) → r，由于该式不是重言式，所以不能够由它判断推理的正确性。问题就出现在这个 “凡” 字，命题逻辑不能够解释这一陈述句的本意。为此，引入了一阶逻辑中的主角——量词。3. 从命题逻辑到一阶逻辑一阶逻辑也称为谓词逻辑，在命题逻辑中，命题是一个具有真假意义的陈述句，但在推理过程中往往会忽视命题具体想要陈述的本意。因此，我们引入元符号来描述命题逻辑中的简单命题中的每一个成分，再将它们组合起来。也就是分别描述成个体词、谓词和量词。这样一来，在事先定义好的个体域上，个体词 + 谓词 + 量词就可以在推理的形式结构符号化中表述（拼凑出）数学中的简单命题的本意。但我的疑问不是为什么引入一阶逻辑，而是一阶逻辑到底是怎么定义的，它跟二阶、高阶逻辑到底是什么关系。4. 从一阶逻辑到二阶、高阶逻辑作为一个初学者，实在不适合继续再探讨一阶逻辑与二阶、高阶逻辑的区别。但我还是希望能够表达一下自己的看法。百度词条对一阶逻辑的解释很粗暴：“一阶逻辑是相对于高阶逻辑存在的数理逻辑，它不允许量化性质。比如说一个物体的颜色，状态等”。这么说，暂时也够用了。但在二阶逻辑中，解除了这一限制，也就是说，谓词能够被量词修饰了，如果对于一个命题中的个体词，它存在任意性质或关系，那么就可以在二阶逻辑中用全称量词来表达。举个例子：“对于任意的个体变项 x 和 y，如果 x 和 y 相等，那么对于任意性质或关系 F，F(x) 当且仅当 F(y)。”这在一阶逻辑中是无法表达出来的。因为一阶逻辑只能量化个体，而性质是包含个体的。但当我们引入了二阶逻辑后，就可以表达出来，这句话用二阶逻辑写出来会是这样：∀x∀y( (x=y) → ∀F(F(x) ↔ F(y) )。从中我们可以看到，二阶逻辑可以量化包含个体词的集合（性质或关系），那么依次类推，更高阶的逻辑就是可以量化前一阶所能量化到的集合的集合。至于为什么不再探讨高阶逻辑，那已经是逻辑学，集合论的范畴了。我会继续学习并补充下去的。5. 题外话有时候，我在电脑前踱步的时候会在想：“数理逻辑的严谨性到底是基于什么？”，这一切可能都源于莱布尼茨发现 0 和 1 之间这一微妙的联系吧。直到今天，我们还沿用基 0 和 1 的二进制，例如计算机系统。为什么计算机要采用二进制，而不是常用的八进制、十六进制呢？因为任何一种事物、一种状态，要将之量化，最直接、最明了的方法就是将之区分为两极。这不但是事物最根本的状态，也是最利于表达的状态。二进制符合计算机的设计思想，电流的速度是非常快的，而电流最明显的两种状态就是导通和截止，这无疑也适合于二进制的使用。因此，在计算机的逻辑电路中，人们就使用 0 和 1 两个数字来代表两种状态。这样一来，一个晶体管就可以用 01 码表示一条信息。集成电路设计已完全采用了二进制语言信息，如果有两个晶体管，就可能产生 01，10，00，11 四种状态的组合，就能表示 4 条信息。依次类推，有 n 个晶体管，就可以表示 22 条信息。由于随着 n 的增长，信息量是按几何级数增长的。所以，可表示的信息状态是极其可观的。硅谷的 “八叛徒” 所创办的仙童半导体公司（我们所熟知的英特尔创始人之一的戈登 · 摩尔就来自这里），早在上个世纪就已经用集成电路技术把成千上万个晶体管做在一起，其处理信息的能力是可想而知的。其实非常凑巧的是，我们前几天才在计算机英语上了解了莱布尼茨，下面截取的是老师给的 PPT，让我们来体会一下： 6. 感谢文章数学符号化的扩充：数理逻辑的兴起数学是什么逻辑学是数学的基础吗？逻辑代数、布尔代数、命题逻辑、数理逻辑一阶逻辑和高阶逻辑的区别，能不能具象一点说明？百度词条：逻辑代数，命题逻辑，命题演算，数理逻辑，知性逻辑与理性逻辑，高阶逻辑，公理化思想，公理化方法后记不得不感叹，数理逻辑真的把 0(false) 和 1(true) 发挥到了极致。","tags":[{"name":"数学","slug":"数学","permalink":"http://yoursite.com/tags/%E6%95%B0%E5%AD%A6/"}],"categories":[]}],"categories":[],"tags":[{"name":"学习认知","slug":"学习认知","permalink":"http://yoursite.com/tags/%E5%AD%A6%E4%B9%A0%E8%AE%A4%E7%9F%A5/"},{"name":"数学","slug":"数学","permalink":"http://yoursite.com/tags/%E6%95%B0%E5%AD%A6/"}]}